app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "MyString"], ["email", "MyString"], ["created_at", "2019-12-29 07:33:58.496511"], ["updated_at", "2019-12-29 07:33:58.496511"]]
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save