app/controllers/opinions_controller.rb

  def index
    @opinions = Opinion.all.order("opinions.created_at desc")
---
SELECT "opinions".* FROM "opinions" ORDER BY opinions.created_at desc

  def edit

    @opinion = Opinion.find(params[:id])
---
SELECT "opinions".* FROM "opinions" WHERE "opinions"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def show
    @opinion = Opinion.find(params[:id])
---
SELECT "opinions".* FROM "opinions" WHERE "opinions"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def set_opinion
      @opinion = Opinion.find(params[:id])
---
SELECT "opinions".* FROM "opinions" WHERE "opinions"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]