app/controllers/products_controller.rb

INSERT INTO "products" ("description", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "MyText"], ["name", "MyString"], ["created_at", "2020-03-06 11:38:11.826172"], ["updated_at", "2020-03-06 11:38:11.826172"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save