app/controllers/static_pages_controller.rb

  def home
    @product = Product.all
---
SELECT "products".* FROM "products"